app/controllers/users_controller.rb

INSERT INTO "users" ("email", "user_name", "firs_name", "last_name", "phone_number", "digital_code", "verified", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    @user.digital_code = User::digital_code
    @user.verified = false
    respond_to do |format|
      if @user.save

UPDATE "users" SET "phone_number" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["phone_number", "+8613503558897"], ["updated_at", "2016-05-24 16:45:57.320922"], ["id", 93719296]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)